{ 
	"test": "something",
	"yes": "yes",
	"about": {
		"title": "Thomas maxwell smith",
		"strapline": "Experienced front-end developer based in London",
		"intro": ["I love handcoding and designing functional and appealing websites, with a strong emphasise on usabilty and user experience.", "After many years of working in both (in-house) and freelance I've developed a broad range of skills from prototyping in code or Photoshop, to conducting user tests, to creating dynamic, complex javascript apps, and to realising beautiful designs into robust, cross-browser complient web pages."]
	}, 
	"skills": [
		{
			"name": "CSS",
			"description": "I write contempory, cross-browser complient SASS with thoughtful naming conventions (currently BEM). Flex rules!"
		},
		{
			"name": "HTML5",
			"description": "I write responsive, seo friendly and accessibilty aware markup. New html5 stuff."
		},
		{
			"name": "Javascript",
			"description": "I code considerate, modular and scalable javascript. I use jQuery where it's effecient, but I'm (use module patterns and explore the deeper end of JS)"
		},
		{
			"name": "Prototyping",
			"description": "I'm a keen believer in prototyping, whether with code or pencil and paper."
		},
		{
			"name": "APIs",
			"description": "I'm familar with learning and using APIs, and for example, have worked with ones like Google Maps, Firebase and Spotify in the past."
		},
		{
			"name": "PHP",
			"description": "I have good beginners grasp of PHP, such as common functions and statements, which I most often utilise for templating purposes."
		},
		{
			"name": "Gulp",
			"description": "I've used Gulp for a long time for compilling and minimsing SASS/JS, and the benfits it can bring for tasks like auto-prefixing and sourcemaps. I've also used webpack and found it an exciting alternative."
		},
		{
			"name": "Performance",
			"description": "I understand the importance of concise code and lean web pages, both for the user and in terms of search rank. I endeavor to push server side (stuff like gzip) and awareness of suitable content."
		},
		{
			"name": "Usability",
			"description": "I have a keen passion for usability, and have instigated and conducted user testing. I understand the (balance) between functional (something) and exciting users."
		},
		{
			"name": "Adobe",
			"description": "I'm comfortable using Adobe packages for presenting concepts, editing assets and other common front-end tasks."
		},
		{
			"name": "Git",
			"description": "I use git on the command line every day for managing projects, and I'm comfortable with the more advanced aspects like branching, stashing or Googling the right command."
		}
	], 
	"projects": [
		{
			"id": 1,
			"name": "Constellations",
			"type": "Freelance",
			"date": "2015",
			"detail": [
				"Constellations are a cool bar and events venue in Liverpool. They wanted a CMS website that focused on their upcoming events, their menu and venue hire.", 
				"I designed and built a site that followed their brand guidlines, utilising their beautiful photography, fonts and design touches like cutoff images and right aligned text.", 
				"The process of building involved signing off on Photoshop mockups of the front page, events page and a generic page template. I used Drupal for the CMS so it would be easy for the"
			],
			"images": [
				{
					"url": "/source/imgs/constellations/front.jpg",
					"alt": "Front page of the Constellations site",
					"description": ""
				},
				{
					"url": "/source/imgs/constellations/event.jpg",
					"alt": "An example of an event page",
					"description": ""
				},
				{
					"url": "/source/imgs/constellations/on.jpg",
					"alt": "Events page for constellations",
					"description": ""
				}			
			]
		},
		{	
			"id": 2,
			"name": "Cambridge Audio",
			"type": "Employment",
			"date": "2015-2017",
			"detail": [
				"As the lead front-end developer I've been responsible for a large part of the brands extensive web presense. As well as the main customer facing home ca.com, there is an ecommerce site, b2b platforms and a training resource.", 
				"Typically I produce work based on designs by the senior graphic designer and consult on technical considerations if necessary. Other projects I spearhead, designing suitable content to meet business needs.", 
				"Some of the work I'm most proud of is designing and developing Find a Dealer page, which uses the Google Maps API to help customers find 1000s of CA dealers around the world. I also really enjoyed developing the product page for the businesses Yoyo range which featured some fun and tricky challenges, like the image gallery and slinding, products innard feature.", 
				"I've also been keen to suggest improvements and embrace to thinking like, improving the site performance, supporting BEM"
			],
			"images": [
				{
					"url": "/source/imgs/ca/yoyo.jpg",
					"alt": "An example product page from Cambridge Audio",
					"description": ""
				}			
			]
		},
		{	
			"id": 3,
			"name": "10-2015",
			"type": "Personal",
			"date": "2016",
			"detail": [
				"This was a small side project to try out some new things, most notably AngularJS. It's a list of some of my favourite music from the previous year, and I wanted it to be fun and easy to read."
			],
			"images": [
				{
					"url": "/source/imgs/10-2015/front.jpg",
					"alt": "The top of mt page for my favourite music of 2015",
					"description": ""
				}			
			]
		},
		{
			"id": 4,
			"name": "Through the Wireframe",
			"type": "Personal",
			"date": "2017",
			"detail": [
				"This is a simple kit for making wireframe prototypes.", 
				"I came out of a prototype I was using, which I expanded to try and offer a reusable staring off point for future projects.", 
				"It uses a cool concept I found online, which I structured into a small CSS library. I also made a random shape generator with JS, just for fun.", "I shared it via Github, and posted news about it on a small web dev forum. So far it has 1 star :)"
			],
			"images": [
				{
					"url": "/source/imgs/wireframe/facebook.jpg",
					"alt": "The top of mt page for my favourite music of 2015",
					"description": ""
				}			
			]
		}
	], 
	"experience": "What's my experience? I guess a brief highlights of my CV. Working freelance projects, moving to CA and other work stff. What i enjoy doing in web dev, in a friendlier, chatty way...?"
}